# Rebar Shape Terminations Data Dispose Method

Source: https://www.revitapidocs.com/2026/cf10242a-5f0f-afe3-4183-fcdffe3aebdc.htm

---

| Rebar Shape Terminations Data Dispose Method |
| --- |

Releases all resources used by the RebarShapeTerminationsData
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

RebarShapeTerminationsData Class Autodesk.Revit.DB.Structure Namespace